<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [2]:
import numpy as np
import pandas as pd

DataFrame

* 2차원 형태의 자료형이다.
* 인덱스, 컬럼, value값으로 이루어져 있다.

In [3]:
import pandas as pd
import numpy as np

# 선언

## from List

- by List : 리스트1 + 리스트2 +... + 컬럼 이름 = 데이타 프레임

In [4]:
a = [1, 3, 4, 5, 6]
b = [3, 2, 1, 1, 1]
pd.DataFrame([a,b])

   0  1  2  3  4
0  1  3  4  5  6
1  3  2  1  1  1

In [5]:
pd.DataFrame({'a':a, 'b':b})

   a  b
0  1  3
1  3  2
2  4  1
3  5  1
4  6  1

In [6]:
list_data = [[1,2,3],[4,5,6], [7,8,9],[10,11,12],[13,14,15]]
pd.DataFrame(list_data)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

## from dict

In [7]:
pd.DataFrame([{'A':2, 'B':4, 'D':3},{'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [8]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2' : [7,8,9],'c3' : [10,11,12], 'c4':[13,14,15]}
pd.DataFrame(dict_data)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

## Series 와 비교를 해보자면

* Series 는 1차원이기 때문에 key 값이 1개라면 Series가 된다. 
* DataFrame 은 2차원이기 때문에 key 값이 2개가 필요하다.
    - 만약 키 값이 1개면, 그 키값은 column에 우선 할당되고, 인덱스는 자동 설정된다.

In [9]:
male_tuple = {'서울특별시': 4732275,
              '부산광역시': 1668618,
              '인천광역시': 1476813,
              '대구광역시': 1198815,
              '대전광역시': 734441,
              '광주광역시': 720060}
female_tuple = {'서울특별시': 4988571,
                '부산광역시': 1735805,
                '인천광역시': 1470404,
                '대구광역시': 1229139,
                '대전광역시': 736599,
                '광주광역시': 734988}

In [10]:
pd.Series(male_tuple)

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [11]:
pd.Series(male_tuple).index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [12]:
pd.Series([male_tuple,female_tuple])

0    {'서울특별시': 4732275, '부산광역시': 1668618, '인천광역시': ...
1    {'서울특별시': 4988571, '부산광역시': 1735805, '인천광역시': ...
dtype: object

In [13]:
pd.Series([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

In [14]:
pd.DataFrame([male_tuple,female_tuple])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

In [15]:
pd.DataFrame([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

## from Series

- by Series :시리즈1 + 시리즈2 + 시리즈3 + 시리즈4 = 데이타프레임

In [16]:
male = pd.Series(male_tuple)
female = pd.Series(female_tuple)

* 아래와 같이 되는 이유는 각각의 value 값에 대응한 시리즈의 index가 컬럼으로 바뀌기 때문이다. 
    - 만약 키 값이 1개면, 그 키값은 column에 우선 할당되고, 인덱스는 자동 설정된다.

In [17]:
pd.DataFrame([male, female])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

간단하게 전치를 해서 컬럼과 인덱스를 바꿀수도 있지만,

In [18]:
pd.DataFrame([male, female]).T

             0        1
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

### 아래와 같이 컬럼값을 지정해서 Series의 index를 DataFrame의 키값으로 변형할 수 있다. 

**DataFrame 생성시에 column을 적어주느냐와 안적어주느냐는 큰 차이가 있다.**

In [19]:
pd.DataFrame({'남자인구수': male, '여자인구수':female})

         남자인구수    여자인구수
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

## from np.random

In [23]:
pd.DataFrame(np.random.randn(4,4))

          0         1         2         3
0  0.958401  1.010590 -1.299424  0.517260
1 -1.082909 -1.437573  0.548160  1.353562
2  0.815610  1.044191 -0.798424  0.153468
3 -0.880910 -0.917102  0.023626 -0.353644

In [24]:
pd.DataFrame(np.random.randint(1, 7, (7,7)))

   0  1  2  3  4  5  6
0  6  2  1  3  3  6  5
1  2  4  1  3  1  5  5
2  5  3  5  4  4  4  5
3  3  2  1  4  6  1  5
4  5  5  2  6  5  5  6
5  1  1  3  4  1  3  1
6  2  4  4  1  3  2  3

In [28]:
nrows, ncols = 10, 10
df1, df2, df3, df4 = (pd.DataFrame(np.random.rand(nrows, ncols)) for i in range(4))
df3

,0,1,2,3,4,5,6,7,8,9
0,0.832789,0.198282,0.941534,0.700395,0.141079,0.669359,0.871345,0.195098,0.678700,0.200505
1,0.953781,0.832832,0.177438,0.015678,0.746182,0.608629,0.000125,0.339196,0.994732,0.604718
2,0.300954,0.346385,0.429499,0.847566,0.794922,0.910002,0.358617,0.039827,0.153160,0.865837
3,0.438714,0.136464,0.390571,0.411294,0.327197,0.273958,0.749227,0.901756,0.026314,0.146202
4,0.137642,0.705500,0.113067,0.250818,0.050386,0.704177,0.673143,0.687600,0.725016,0.223733
5,0.348958,0.440207,0.772725,0.306906,0.812388,0.134903,0.016173,0.693948,0.501666,0.459473
6,0.706278,0.349080,0.446679,0.382387,0.627056,0.250908,0.464922,0.450482,0.660231,0.087183
7,0.843825,0.241324,0.051088,0.289386,0.143350,0.009256,0.903443,0.521516,0.476866,0.989958
8,0.517487,0.667808,0.590376,0.960487,0.962669,0.243191,0.212714,0.849155,0.668644,0.596369
9,0.940465,0.877483,0.919561,0.848613,0.875998,0.170676,0.204295,0.251357,0.467145,0.781174

## OrderedDict로 데이터프레임 생성하기
OrderedDict 자료구조로 데이터프레임을 생성하면, 컬럼의 순서가 뒤바뀌지 않습니다.

In [29]:
from collections import OrderedDict

In [30]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from other sauce

* pd.read_csv 등등 수많은 sauce( html, json, 등등)

## from other DataFrame

- by other dataframe's columns : 컬럼1 + 컬럼2  +...= 데이타 프레임 
- by other dataframe's columns : dfA 컬럼 1 + dfB 컬럼 2   +...= 데이타 프레임

In [ ]:
df1 = pd.DataFrame(np.random.randn(5,3), index=pd.date_range('01/02/2014',periods=5,freq='D'), columns=['a','b','c'] )
df2 = pd.DataFrame(np.random.randn(8,3), index=pd.date_range('01/01/2014',periods=8,freq='D'), columns=['a','b','c'] )

In [ ]:
df1

In [ ]:
df1['a']

In [ ]:
# 시리즈를 2개 묶은것
pd.DataFrame([df1['a'],df2['b']])

In [ ]:
pd.DataFrame({'a':df1['a'], 'b': df2['b']})

In [ ]:
pd.DataFrame(df1[['a','b']])

In [ ]:
pd.DataFrame({'a':df1['a'], 'b':df1['b']})

출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas